CSI API ETABS v1

# cAreaObjGetOffsets3 Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetOffsets3(
    	string Name,
    	ref int NumberPoints,
    	ref double[] Offsets
    )

    Function GetOffsets3 (
    	Name As String,
    	ByRef NumberPoints As Integer,
    	ByRef Offsets As Double()
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim NumberPoints As Integer
    Dim Offsets As Double()
    Dim returnValue As Integer

    returnValue = instance.GetOffsets3(Name,
    	NumberPoints, Offsets)

    int GetOffsets3(
    	String^ Name,
    	int% NumberPoints,
    	array<double>^% Offsets
    )

    abstract GetOffsets3 :
            Name : string *
            NumberPoints : int byref *
            Offsets : float[] byref -> int

#### Parameters

Name

    Type: SystemString

NumberPoints

    Type: SystemInt32

Offsets

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com